/*==============================================================================

   ジョブ基底クラス 実装 [JobBase.cpp]
                                                         Author : 51106
                                                         Date   : 2025/12/16
--------------------------------------------------------------------------------

==============================================================================*/
#include "JobBase.h"
#include "Fighter.h"

void JobBase::Special(Fighter&, Fighter&)
{
    // デフォルトは何もしないので空にしておく
    //ポケモンのわるあがき的なの入れようかな
}
